2.2.013/src/DataProcessors/МК_ОтправкаДокумента/МК_ОтправкаДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МК_ОтправкаДокумента</name>
</mdclass:DataProcessor>

2.2.013/src/Catalogs/МК_СертификатыПодписей/МК_СертификатыПодписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_СертификатыПодписей</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатЭЦП</name>
    <type>
      <types>CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/DataProcessors/МК_ОтправкаДокумента/Forms/МК_ПодписаниеЭЦП/Module.bsl
&НаКлиенте
Процедура Отменить(Команда)
	// Закрыть форму и вернуть признак отмены.
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МК_Продолжить(Команда)                         
	мРез = Истина;
	мПарам = Неопределено;
	Если Не ЗначениеЗаполнено(ЭтаФорма.СертификатПодписи) Тогда
		ПоказатьПредупреждение(,"Не выбран сертификат ЭЦП. Продолжение невозможно");		
	ИначеЕсли Не ЗначениеЗаполнено(ЭтаФорма.ФизЛицо) Тогда
		ПоказатьПредупреждение(,"Для сертификата ЭЦП не указано физическое лицо - владелец. Продолжение невозможно");			
	Иначе
		Если ЭтаФорма.ВладелецФормы.СоздаватьЭЦПНаСервере Тогда
			ПараметрыПодписи = Новый Структура("Сертификат,Пароль,ФизЛицо",СертификатПодписи,Пароль,ФизЛицо);
			мПарам = Новый Структура("ТабДок,IDДокумента,СсылкаНаДокумент,ПараметрыПодписи, PDF",
				ЭтаФорма.ТаблДокумент,ЭтаФорма.IDдокумента,ЭтаФорма.СсылкаНаДокумент,ПараметрыПодписи,ЭтаФорма.АдресPDF);
			ЭтаФорма.Закрыть(мПарам);
		Иначе	        // Подписание на клиенте
			мПрограмма = ПолучитьПрограмму(СертификатПодписи);
			Оповещение = Новый ОписаниеОповещения("ПолучитьМенеджерКрипты", ЭтотОбъект);
			ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(Оповещение, "Подписание",Истина,мПрограмма);
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры                                           

&НаСервереБезКонтекста
Функция ПолучитьПрограмму(мСертификат)
	мПрограмма = мСертификат.СертификатЭЦП.Программа;
	Возврат мПрограмма;
КонецФункции	

&НаКлиенте
Процедура ПолучитьМенеджерКрипты(мМенеджерКрипты, Параметр)     Экспорт
	ПараметрыПодписи = Новый Структура("Сертификат,Пароль,ФизЛицо,МЧД",СертификатПодписи,Пароль,ФизЛицо,МЧД);
	мПарам = Новый Структура("ТабДок,IDДокумента,СсылкаНаДокумент,ПараметрыПодписи,МенеджерКрипты",ЭтаФорма.ТаблДокумент,ЭтаФорма.IDдокумента,ЭтаФорма.СсылкаНаДокумент,ПараметрыПодписи,мМенеджерКрипты);
	ЭтаФорма.Закрыть(мПарам);
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТаблДокумент = Параметры.ТабличныйДокумент;
	ЭтаФорма.IDдокумента = Параметры.IDДокумента; 
	ЭтаФорма.СсылкаНаДокумент = Параметры.НовыйУИД; 
	мОрг = Параметры.Организация; 
	// Надо найти нужный сертификат.
	мПользователь = Пользователи.ТекущийПользователь();    
	мСерт = ПолучитьСертификат(мПользователь,мОрг);  // Возвращается массив: [Сертификат,МЧД]
	Если мСерт = Неопределено Тогда	
	Иначе	                       
		ЭтаФорма.СертификатПодписи = мСерт[0];
		ЭтаФорма.МЧД = мСерт[1];
		Если ЗначениеЗаполнено(ЭтаФорма.СертификатПодписи.СертификатЭЦП.ФизическоеЛицо) Тогда   
			ЭтаФорма.ФизЛицо = ЭтаФорма.СертификатПодписи.СертификатЭЦП.ФизическоеЛицо;
		КонецЕсли;
	КонецЕсли;	
	мПароль = ПараметрыСеанса.МК_ПарольЭЦП;
	Если мПароль <> "НеЗадан" Тогда
		ЭтаФорма.Пароль = ПараметрыСеанса.МК_ПарольЭЦП;
	КонецЕсли;	
	
КонецПроцедуры             

Функция ПолучитьСертификат(мПользователь,мОрг)
	мВозврат = Неопределено;
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ТекущийПользователь",мПользователь);	
	мЗапрос.УстановитьПараметр("мОрганизация",мОрг);
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	МК_Сертификаты.Ссылка КАК Ссылка,	
	|	МК_Сертификаты.МЧД КАК МЧД	
	|ИЗ 
	|	Справочник.МК_СертификатыПодписей КАК МК_Сертификаты
	|ГДЕ
	|	НЕ МК_Сертификаты.ПометкаУдаления
	|   И (МК_Сертификаты.Пользователь = &ТекущийПользователь)	
	|   И (МК_Сертификаты.Организация = &мОрганизация)";
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Если Выборка.Следующий() Тогда
		мВозврат = Новый Массив;
		мВозврат.Добавить(Выборка.Ссылка);
		мВозврат.Добавить(Выборка.МЧД);
	КонецЕсли;	

    Возврат мВозврат;
КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ЭтаФорма.СертификатПодписи) Тогда
		Сообщить("Не найден сертификат ЭЦП, подходящий для текущего пользователя и организации");
	Иначе
		Если Не ЗначениеЗаполнено(ЭтаФорма.ФизЛицо) Тогда                                        
			Сообщить("Для сертификата ЭЦП не указано физическое лицо - владелец");
		КонецЕсли;	
	КонецЕсли	
КонецПроцедуры


&НаКлиенте
Процедура ЗапомнитьПарольПриИзменении(Элемент)
	ЗапомнитьПарольНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьПарольНаСервере() 
	ПараметрыСеанса.МК_ПарольЭЦП = ЭтаФорма.Пароль;     	 
КонецПроцедуры
